tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_adc.c
    }
  }

  /* If a conversion is on going on regular group, no update on regular       */
  /* channel could be done on neither of the channel configuration structure  */
  /* parameters.                                                              */
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

    tmp_hal_status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Configure the analog watchdog.
  * @note   Possibility to update parameters on the fly:
  *         This function initializes the selected analog watchdog, successive
  *         calls to this function can be used to reconfigure some parameters
  *         of structure "ADC_AnalogWDGConfTypeDef" on the fly, without resetting
  *         the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  *         For parameters constraints, see comments of structure
  *         "ADC_AnalogWDGConfTypeDef".
  * @note   On this mcu series, analog watchdog thresholds can be modified
  *         while ADC conversion is on going.
  *         In this case, some constraints must be taken into account:
  *         the programmed threshold values are effective from the next
  *         ADC EOC (end of unitary conversion).
  *         Considering that registers write delay may happen due to
  *         bus activity, this might cause an uncertainty on the
  *         effective timing of the new programmed threshold values.
  * @param hadc ADC handle
  * @param pAnalogWDGConfig Structure of ADC analog watchdog configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef *hadc, const ADC_AnalogWDGConfTypeDef *pAnalogWDGConfig)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;
  uint32_t tmp_awd_high_threshold_shifted;
  uint32_t tmp_awd_low_threshold_shifted;
  uint32_t tmp_adc_is_conversion_on_going_regular;
  uint32_t tmp_adc_is_conversion_on_going_injected;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_ANALOG_WATCHDOG_MODE(pAnalogWDGConfig->WatchdogMode));
  assert_param(IS_ADC_ANALOG_WATCHDOG_FILTERING_MODE(pAnalogWDGConfig->FilteringConfig));
  assert_param(IS_FUNCTIONAL_STATE(pAnalogWDGConfig->ITMode));

  if ((pAnalogWDGConfig->WatchdogMode == ADC_ANALOGWATCHDOG_SINGLE_REG)     ||
      (pAnalogWDGConfig->WatchdogMode == ADC_ANALOGWATCHDOG_SINGLE_INJEC)   ||
      (pAnalogWDGConfig->WatchdogMode == ADC_ANALOGWATCHDOG_SINGLE_REGINJEC))
  {
    assert_param(IS_ADC_CHANNEL(hadc, pAnalogWDGConfig->Channel));
  }

  /* Verify if thresholds are within the selected ADC resolution */
  assert_param(IS_ADC_RANGE(ADC_GET_RESOLUTION(hadc), pAnalogWDGConfig->HighThreshold));
  assert_param(IS_ADC_RANGE(ADC_GET_RESOLUTION(hadc), pAnalogWDGConfig->LowThreshold));


  /* Process locked */
  __HAL_LOCK(hadc);

  /* Parameters update conditioned to ADC state:                              */
  /* Parameters that can be updated when ADC is disabled or enabled without   */
  /* conversion on going on ADC groups regular and injected:                  */
  /*  - Analog watchdog channels                                              */
  tmp_adc_is_conversion_on_going_regular = LL_ADC_REG_IsConversionOngoing(hadc->Instance);
  tmp_adc_is_conversion_on_going_injected = LL_ADC_INJ_IsConversionOngoing(hadc->Instance);
  if ((tmp_adc_is_conversion_on_going_regular == 0UL)
      && (tmp_adc_is_conversion_on_going_injected == 0UL)
     )
  {
    /* Configuration of analog watchdog:                                    */
    /*  - Set the analog watchdog enable mode: one or overall group of      */
    /*    channels, on groups regular and-or injected.                      */
    switch (pAnalogWDGConfig->WatchdogMode)
    {
      case ADC_ANALOGWATCHDOG_SINGLE_REG:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance,
                                        __LL_ADC_ANALOGWD_CHANNEL_GROUP(pAnalogWDGConfig->Channel,
                                                                        LL_ADC_GROUP_REGULAR));
        break;

      case ADC_ANALOGWATCHDOG_SINGLE_INJEC:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance,
                                        __LL_ADC_ANALOGWD_CHANNEL_GROUP(pAnalogWDGConfig->Channel,
                                                                        LL_ADC_GROUP_INJECTED));
        break;

      case ADC_ANALOGWATCHDOG_SINGLE_REGINJEC:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance,
                                        __LL_ADC_ANALOGWD_CHANNEL_GROUP(pAnalogWDGConfig->Channel,
                                                                        LL_ADC_GROUP_REGULAR_INJECTED));
        break;

      case ADC_ANALOGWATCHDOG_ALL_REG:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance, LL_ADC_AWD_ALL_CHANNELS_REG);
        break;

      case ADC_ANALOGWATCHDOG_ALL_INJEC:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance, LL_ADC_AWD_ALL_CHANNELS_INJ);
        break;

      case ADC_ANALOGWATCHDOG_ALL_REGINJEC:
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance, LL_ADC_AWD_ALL_CHANNELS_REG_INJ);
        break;

      default: /* ADC_ANALOGWATCHDOG_NONE */
        LL_ADC_SetAnalogWDMonitChannels(hadc->Instance, LL_ADC_AWD_DISABLE);
        break;
    }

    /* Set the filtering configuration */
    MODIFY_REG(hadc->Instance->TR,
               ADC_TR_AWDFILT,
               pAnalogWDGConfig->FilteringConfig);

    /* Update state, clear previous result related to AWD1 */
    CLEAR_BIT(hadc->State, HAL_ADC_STATE_AWD);

    /* Clear flag ADC analog watchdog */
    /* Note: Flag cleared Clear the ADC Analog watchdog flag to be ready  */
    /* to use for HAL_ADC_IRQHandler() or HAL_ADC_PollForEvent()          */
    /* (in case left enabled by previous ADC operations).                 */
    LL_ADC_ClearFlag_AWD(hadc->Instance);

