tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_adc.c
    /* Configure ADC analog watchdog interrupt */
    if (pAnalogWDGConfig->ITMode == ENABLE)
    {
      LL_ADC_EnableIT_AWD(hadc->Instance);
    }
    else
    {
      LL_ADC_DisableIT_AWD(hadc->Instance);
    }
    
  }

  /* Shift the offset with respect to the selected ADC resolution:        */
  /* Thresholds have to be left-aligned on bit 11, the LSB (right bits)   */
  /* are set to 0.                                                        */
  tmp_awd_high_threshold_shifted = ADC_AWDTHRESHOLD_SHIFT_RESOLUTION(hadc, pAnalogWDGConfig->HighThreshold);
  tmp_awd_low_threshold_shifted  = ADC_AWDTHRESHOLD_SHIFT_RESOLUTION(hadc, pAnalogWDGConfig->LowThreshold);

  /* Set ADC analog watchdog thresholds value of both thresholds high and low */
  LL_ADC_ConfigAnalogWDThresholds(hadc->Instance, tmp_awd_high_threshold_shifted,
                                  tmp_awd_low_threshold_shifted);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Configures the the ADC VrefBuf
  * @param  hadc: ADC handle
  * @param  VrefBuf the ADC VrefBuf.
  *          This parameter can be one of the following values:
  *            @arg ADC_VREFBUF_VCCA  
  *            @arg ADC_VREFBUF_1P024V
  *            @arg ADC_VREFBUF_1P5V  
  *            @arg ADC_VREFBUF_2P048V  
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_ConfigVrefBuf(ADC_HandleTypeDef* hadc, uint32_t VrefBuf)
{ 
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;
  ADC_Common_TypeDef *tmpADC_Common;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_VREFBUF(VrefBuf));
 
  /* Process locked */
  __HAL_LOCK(hadc);
  
  /* Pointer to the common control register */
  tmpADC_Common = __LL_ADC_COMMON_INSTANCE(hadc->Instance);

  if (LL_ADC_IsEnabled(ADC1) == 0UL)
  {
    if( VrefBuf == ADC_VREFBUF_VCCA)
    {
      CLEAR_BIT(tmpADC_Common->CCR, ADC_CCR_VREFSEL);
    }
    else
    {
      SET_BIT(tmpADC_Common->CCR, ADC_CCR_VREFSEL);
      HAL_SYSCFG_VREFBUFConfig(VrefBuf);
    }
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);
  
  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Configures the the ADC PowerMode
  * @param  hadc: ADC handle
  * @param  PowerMode the ADC PowerMode.
  *          This parameter can be one of the following values:
  *            @arg ADC_POWER_MODE_6uA  
  *            @arg ADC_POWER_MODE_7uA
  *            @arg ADC_POWER_MODE_8uA  
  *            @arg ADC_POWER_MODE_9uA 
  *            @arg ADC_POWER_MODE_2uA  
  *            @arg ADC_POWER_MODE_3uA
  *            @arg ADC_POWER_MODE_4uA  
  *            @arg ADC_POWER_MODE_5uA  
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_ConfigPowerMode(ADC_HandleTypeDef* hadc, uint32_t PowerMode)
{ 
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;
  ADC_Common_TypeDef *tmpADC_Common;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_VREFBUF(VrefBuf));
 
  /* Process locked */
  __HAL_LOCK(hadc);
  
  /* Pointer to the common control register */
  tmpADC_Common = __LL_ADC_COMMON_INSTANCE(hadc->Instance);

  if (LL_ADC_IsEnabled(ADC1) == 0UL)
  {
    MODIFY_REG(tmpADC_Common->CCR,ADC_CCR_PWR_MODE,PowerMode);
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);
  
  /* Return function status */
  return tmp_hal_status;
}
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group4 Peripheral State functions
  *  @brief    ADC Peripheral State functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral state and errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions to get in run-time the status of the
    peripheral.
      (+) Check the ADC state
      (+) Check the ADC error code

@endverbatim
  * @{
  */

/**
  * @brief  Return the ADC handle state.
  * @note   ADC state machine is managed by bitfields, ADC status must be
  *         compared with states bits.
  *         For example:
  *           " if ((HAL_ADC_GetState(hadc1) & HAL_ADC_STATE_REG_BUSY) != 0UL) "
  *           " if ((HAL_ADC_GetState(hadc1) & HAL_ADC_STATE_AWD1) != 0UL) "
  * @param hadc ADC handle
  * @retval ADC handle state (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetState(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Return ADC handle state */
  return hadc->State;
}

/**
  * @brief  Return the ADC error code.
  * @param hadc ADC handle
  * @retval ADC error code (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetError(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  return hadc->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Functions ADC Private Functions
  * @{
  */

/**
  * @brief  Stop ADC conversion.
  * @param hadc ADC handle
  * @param ConversionGroup: ADC group regular and/or injected.
  *          This parameter can be one of the following values:
  *            @arg @ref ADC_REGULAR_GROUP           ADC regular conversion type.
  *            @arg @ref ADC_INJECTED_GROUP          ADC injected conversion type.
  *            @arg @ref ADC_REGULAR_INJECTED_GROUP  ADC regular and injected conversion type.
  * @retval HAL status.
  */
HAL_StatusTypeDef ADC_ConversionStop(ADC_HandleTypeDef* hadc, uint32_t ConversionGroup)
{
  uint32_t tickstart;
  uint32_t Conversion_Timeout_CPU_cycles = 0UL;
  uint32_t conversion_group_reassigned = ConversionGroup;
  uint32_t tmp_ADC_CR_ADSTART_JADSTART;
  uint32_t tmp_adc_is_conversion_on_going_regular;
  uint32_t tmp_adc_is_conversion_on_going_injected;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_CONVERSION_GROUP(ConversionGroup));

